const baseModel = require('../../db/baseModel');

class Company extends baseModel {
    Company() {
    }

    async getInfoAboutUs() {
        const text =
            `
Проект QuickStart - це площадка для вивчення програмування, яка зосереджує свою увагу на головних аспектах необхідних для роботи в сфері it. Дана ідея виникла, коли деякі наші знайомі розповідаючи, як важко та нудно їм вчити черговий розділ попросили нас порадити їм хороші курси, ми не змогли цього зробити, тому що самі вивчали курси з тих же джерел. Зараз оглядуючись назад, ми розуміємо, що більшість курсів чи навіть підручників непогано подають матеріал, але проблема полягає в тому, що більшість з нього вам не знадобиться. Отож, усвідомивши що розуміння 40% від усієї інформації дає можливість виконувати 95% задач, які ви можете отримати в перші 1.5 року роботи, було вирішено створити проект під назвою "QuickStart" для тих людей, хто бажає якомога швидше отримати позицію в сфері програмування та має достатньо сили волі щоб працювати над собою після отримання першої пропозиції. 
Автори курсів: 
Ісус Христос Анатолійович (25 років) - Node.js Developer. Досвід: 
2 роки - писав сервер для медичного сайту в компації GlobalLogic.
2.5 роки - створював сервер для газопостачання в певоному регіоні.
1.5 роки - працюю з blockchain та nft на проекті ChillChat.me.
Бобер Олексій Сергійович (21 рік) - душевнохворий.
    `;
        return text;
    }

    async getContacts() {
        return `phone: +380636247364\ne-mail: quickstartP@gmail.com`;
    }

    async getPrice() {
        return `
100$ per month (3 months)
300$ full course
    `;
    }

    async getCourses() {
        const coursesInfo = `
Node.js - в даному курсі ми пройдемося по основних темах з javascript. Але основна увага буде зосереджена на Node.js та інших необхідних вам навичках, таких як: бази даних, робота з запитами, різні види аутентифікації та багато іншого. Значна частина курсу виділена для навчання шляхом створення власного проекту, тож по закінченню курсу у вас буде 2 готових проекта, які ви впевненно зможете добавити собі в портфоліо. (Початок: 1 березня)
`
        return coursesInfo;
    }
}

module.exports = Company;
